---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveSupportOffset
source: html/8135ac8a-e5d1-a982-0ffe-ce7f1897326b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveSupportOffset Property

"Wall offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveSupportOffset { get; }
```